БухЭксп/Documents/CW_РеестрПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_РеестрПлатежей</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Офис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ОфисыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплачен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статья</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ПланированиеДДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СтатусыПланированиеДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СтатусыПланированиеДДС</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_СтатусыПланированияДДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПланированиеДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПланированиеДДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СоставРеестраПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СоставРеестраПлатежей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>РеестрПлатежей</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РеестрПлатежей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлатежноеПоручение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_СтатусыПланированияДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_СтатусыПланированияДДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>План</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыДвиженияДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыДвиженияДДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Documents/CW_РеестрПлатежей/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьСуммуПлатежныхПоручений();
	
	ТекущаяДатаДокумента = Объект.Дата;
	ТекущаяОрганизация = Объект.Организация;
	
	Элементы.ФормаСформироватьПлатежныеПоручения.Доступность = Не Параметры.Ключ.Пустая();

	//Для версии КОРП
	ВестиУчетПоПодразделениям					= ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	Элементы.ПодразделениеОрганизации.Видимость	= ВестиУчетПоПодразделениям;
	//Для версии КОРП
	
	УстановитьОтборСпискаПоручений();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСпискаПоручений()
	
	ПлатежныеПоручения.Отбор.Элементы.Очистить();
	
	НовЭлементОтбора = ПлатежныеПоручения.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовЭлементОтбора.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("РеестрПлатежей"); 
	НовЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно; 
	НовЭлементОтбора.Использование 		= Истина; 
	НовЭлементОтбора.ПравоеЗначение 	= Объект.Ссылка;
	НовЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьИтоги()
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыПлатежаПриИзменении(Элемент)
	ОбновитьИтоги();
КонецПроцедуры     

&НаКлиенте
Процедура ОбъектыПлатежаСтатьяПриИзменении(Элемент)
	Элемент.Родитель.ТекущиеДанные.Сумма = ПолучитьСумму(Элемент.Родитель.ТекущиеДанные.Статья);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСумму(Статья)
	Возврат Статья.Сумма	
КонецФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_ПланированиеДДС.Ссылка КАК Статья,
		|	CW_ПланированиеДДС.Сумма КАК Сумма
		|ИЗ
		|	РегистрСведений.CW_СтатусыПланированиеДДС.СрезПоследних(&ДатаСреза, Статус = ЗНАЧЕНИЕ(Перечисление.CW_СтатусыПланированияДДС.Согласована)) КАК CW_СтатусыПланированиеДДССрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CW_ПланированиеДДС КАК CW_ПланированиеДДС
		|		ПО CW_СтатусыПланированиеДДССрезПоследних.ПланированиеДДС = CW_ПланированиеДДС.Ссылка
		|ГДЕ
		|	CW_ПланированиеДДС.Организация = &Организация
		|	И CW_ПланированиеДДС.Офис = &Офис
		|	И CW_ПланированиеДДС.Валюта = &Валюта
		|	И CW_ПланированиеДДС.ПланОплаты = &ПланОплаты
		|	И CW_ПланированиеДДС.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.CW_ВидыДвиженияДДС.Расход)
		|	И CW_ПланированиеДДС.Сценарий = ЗНАЧЕНИЕ(Справочник.CW_СценарииПланированияДДС.Недельный)
		|	И CW_ПланированиеДДС.ПодразделениеОрганизации = &ПодразделениеОрганизации";
	
	Запрос.УстановитьПараметр("Валюта", 		Объект.Валюта);
	Запрос.УстановитьПараметр("Организация", 	Объект.Организация);
	Запрос.УстановитьПараметр("Офис", 			Объект.Офис);
	Запрос.УстановитьПараметр("ПланОплаты", 	НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("ДатаСреза", 		ТекущаяДата());  
	
	//Для версии КОРП
	Запрос.УстановитьПараметр("ПодразделениеОрганизации", Объект.ПодразделениеОрганизации);  
	//Для версии КОРП
	
	Объект.ОбъектыПлатежа.Загрузить(Запрос.Выполнить().Выгрузить()); 
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
	ОбновитьИтоги();
КонецПроцедуры
 
&НаСервере
Процедура ОбновитьИтоги()
	Если Объект.ОбъектыПлатежа.Количество() = 0 Тогда
		ИтогоСтрокой = "";
	Иначе
		ИтогоСтрокой = "Сумма: " + Формат(Объект.ОбъектыПлатежа.Итог("Сумма"),"ЧЦ=15; ЧДЦ=2; ЧН=") + " " + Строка(Объект.Валюта);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьСуммуПлатежныхПоручений()
	
	СуммаПлатежныхПоручений = РегистрыСведений.CW_СоставРеестраПлатежей.ПолучитьСуммуПлатежныхПорученийОбъекта(Объект.Ссылка);
	
	ИтогоСтрокойПлатежныеПоручения = "Сумма: " + Формат(СуммаПлатежныхПоручений,"ЧЦ=15; ЧДЦ=2; ЧН=") + " " + Строка(Объект.Валюта);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ВремТаблица = Объект.ОбъектыПлатежа.Выгрузить();
	ВремТаблица.Свернуть("Статья", "Сумма");	
		
	Если ВремТаблица.Количество() <> Объект.ОбъектыПлатежа.Количество() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дублирование статей в строках", ,,,,Отказ);
	КонецЕсли;

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	МассивУдаленныхСтатей 		= ПолучитьМассивУдаленныхСтатей();
	АдресМассиваУдаленныхСтатей = ПоместитьВоВременноеХранилище(МассивУдаленныхСтатей, УникальныйИдентификатор);
	
	УстановитьОтборСпискаПоручений();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивУдаленныхСтатей()
	
	ТекущиеСтатьи = Объект.ОбъектыПлатежа.Выгрузить().ВыгрузитьКолонку("Статья");
	
	УдаленныеСтатьи = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_РеестрПлатежейОбъектыПлатежа.Статья КАК Статья
	               |ИЗ
	               |	Документ.CW_РеестрПлатежей.ОбъектыПлатежа КАК CW_РеестрПлатежейОбъектыПлатежа
	               |ГДЕ
	               |	CW_РеестрПлатежейОбъектыПлатежа.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий()  Цикл
		Если ТекущиеСтатьи.Найти(Выборка.Статья) = Неопределено Тогда
			УдаленныеСтатьи.Добавить(Выборка.Статья);
		КонецЕсли;
	КонецЦикла;
	
	Возврат УдаленныеСтатьи;
	
КонецФункции


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(АдресМассиваУдаленныхСтатей) Тогда
		МассивУдаленныхСтатей = ПолучитьИзВременногоХранилища(АдресМассиваУдаленныхСтатей);
		УстановитьПредыдущийСтатус(МассивУдаленныхСтатей);
	КонецЕсли;
	
	Элементы.ФормаСформироватьПлатежныеПоручения.Доступность = Истина;
	
	УстановитьОтборСпискаПоручений();
	УстановитьТекущийСтатус();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекущийСтатус()
	
	Для Каждого СтрокаОбъекта из Объект.ОбъектыПлатежа Цикл
		
		Если Объект.Оплачен Тогда
			Статус = ПредопределенноеЗначение("Перечисление.CW_СтатусыПланированияДДС.Оплачено");
		Иначе
			Статус = ПредопределенноеЗначение("Перечисление.CW_СтатусыПланированияДДС.ВОплате");
		КонецЕсли;
		
		РегистрыСведений.CW_СтатусыПланированиеДДС.ЗаписатьСтатусВРегистр(СтрокаОбъекта.Статья, Статус);
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПредыдущийСтатус(МассивУдаленныхСтатей)
	
	Для Каждого ЭлементМассива из МассивУдаленныхСтатей Цикл
		
		ПредыдущийСтатус = ПредопределенноеЗначение("Перечисление.CW_СтатусыПланированияДДС.Согласована");
		РегистрыСведений.CW_СтатусыПланированиеДДС.ЗаписатьСтатусВРегистр(ЭлементМассива,ПредыдущийСтатус);
	
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	Если ТекущаяОрганизация <> Объект.Организация Тогда
		Объект.Номер = "";
		ТекущаяОрганизация = Объект.Организация;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	УчетДенежныхСредствБП.УстановитьБанковскийСчет(
		Объект.СчетОрганизации,
		Объект.Организация,
		Объект.Валюта);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если НачалоДня(Объект.Дата) = НачалоДня(ТекущаяДатаДокумента) Тогда
		// Изменение времени не влияет на поведение документа.
		ТекущаяДатаДокумента = Объект.Дата;
		Возврат;
	КонецЕсли;
	
	Если Год(Объект.Дата) <> Год(ТекущаяДатаДокумента) Тогда
		//Изменился год документа
		Объект.Номер = "";
		ТекущаяДатаДокумента = Объект.Дата;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПлатежныеПоручения(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("Записать", Ложь);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьФормированиеПлатежныхПоручений", ЭтотОбъект, ДополнительныеПараметры);
	
	Если Модифицированность Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ДополнительныеПараметры.Записать = Истина;
		ПоказатьВопрос(ОписаниеОповещения, "Документ будет записан. Продолжить?",Режим,0); 
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, КодВозвратаДиалога.Да); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьФормированиеПлатежныхПоручений(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Записать Тогда
		Записать();
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьОтветПовторногоФормированияПлатежныхПоручений", ЭтотОбъект);
	
	Если Не ПроверитьНаличиеПлатежныхПоручений() Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(ОписаниеОповещения, "Платежные поручения к документу уже сформированы. Продолжить?",Режим,0); 
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, КодВозвратаДиалога.Да); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтветПовторногоФормированияПлатежныхПоручений(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения =  ПродолжитьФормированиеДокументовНаСервереВФоне();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатФормированияДокументов", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ПродолжитьФормированиеДокументовНаСервереВФоне()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Формирование платежных поручений";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Ссылка", 			Объект.Ссылка);
	ПараметрыПроцедуры.Вставить("Дата", 			Объект.Дата);
	ПараметрыПроцедуры.Вставить("Организация", 		Объект.Организация);
	ПараметрыПроцедуры.Вставить("ПодразделениеОрганизации", Объект.ПодразделениеОрганизации);
	ПараметрыПроцедуры.Вставить("СчетОрганизации", 	Объект.СчетОрганизации);
	ПараметрыПроцедуры.Вставить("Валюта", 			Объект.Валюта);
	  
	Возврат ДлительныеОперации.ВыполнитьВФоне("Документы.CW_РеестрПлатежей.СформироватьПлатежныеПоручения",ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатФормированияДокументов(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		КоличествоДокументов = 0;
		ЗаписатьСоставРеестраНаСерере(РезультатВыполнения.АдресРезультата, КоличествоДокументов);
		
		ПоказатьОповещениеПользователя("Сформированы документы",,"Сформированы документы Платежное поручение ("+Формат(КоличествоДокументов,"ЧГ=0")+"):",,СтатусОповещенияПользователя.Информация);
		
		Элементы.ПлатежныеПоручения.Обновить();
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Документы не сформированы!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
			 СообщениеВМассиве.Сообщить();
		КонецЦикла;
		
	
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка формирования документов");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСоставРеестраНаСерере(АдресРезультата, КоличествоДокументов);
	
	СоставРеестра = ПолучитьИзВременногоХранилища(АдресРезультата);   
	РегистрыСведений.CW_СоставРеестраПлатежей.ЗаписатьСоставРеестраПлатежей(Объект.Ссылка, СоставРеестра);
	
	КоличествоДокументов = СоставРеестра.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыПлатежаПередУдалением(Элемент, Отказ)
	
	Если Не ПроверитьНаличиеПлатежныхПоручений() Тогда
		Отказ = Истина;
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение, "К реесту уже сформированы платежные поручения. Удалить выделенные строки?", Режим, 0);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Функция ПроверитьНаличиеПлатежныхПоручений()
	
	Возврат РегистрыСведений.CW_СоставРеестраПлатежей.ПроверитьНаличиеПлатеюныхПоручениеПоОбъекту(Объект.Ссылка);
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	мВыделенныеСтроки = Элементы.ОбъектыПлатежа.ВыделенныеСтроки;

	мСтрокиКУдалению = Новый Массив;
	Для Каждого ИдентфикаторСтроки из мВыделенныеСтроки Цикл
		СтрокаРееста = Объект.ОбъектыПлатежа.НайтиПоИдентификатору(ИдентфикаторСтроки);
		мСтрокиКУдалению.Добавить(СтрокаРееста);
	КонецЦикла;

	Для Каждого СтрокаРееста из мСтрокиКУдалению Цикл
		Объект.ОбъектыПлатежа.Удалить(СтрокаРееста);
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗаявкуНаРасход(Команда)
	
	ТекущиеДанные = Элементы.ОбъектыПлатежа.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Статья);
	
	ОткрытьФорму("Справочник.CW_ПланированиеДДС.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПлатежноеПоручение(Команда)
	
	мВыделенныеСтроки = Элементы.ПлатежныеПоручения.ВыделенныеСтроки;
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбУдаленииПлатежногоПоручения", ЭтотОбъект, Параметры);
	
	Если мВыделенныеСтроки.Количество() = 1 Тогда
		ТекстВопроса = "Платежное поручение будет помечено на удаление. Продолжить?";
	Иначе
		ТекстВопроса = "Платежные поручения будут помечены на удаление. Продолжить?";
	Конецесли;
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбУдаленииПлатежногоПоручения(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	ОбработатьУдалениеПлатежныхПорученийНаСервере();
	
	Элементы.ПлатежныеПоручения.Обновить();

КонецПроцедуры

&НаСервере
Процедура ОбработатьУдалениеПлатежныхПорученийНаСервере()
	
	мВыделенныеСтроки = Элементы.ПлатежныеПоручения.ВыделенныеСтроки;
	РегистрыСведений.CW_СоставРеестраПлатежей.ОбработатьУдалениеПлатежныхПорученийОбъекта(Объект.Ссылка, мВыделенныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//Подсистема.РаботаСПодключаемымиОбъектами
	CW_ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	//Подсистема.РаботаСПодключаемымиОбъектами

КонецПроцедуры
